<?php
// решето Эратосфена
function seive ($n) {
    $S = array();
    $S[1] = 0; // 1 - не простое число
    // заполняем решето единицами
    for ($k = 2; $k <= $n; $k++) {
        $S[$k] = 1;
    }
    for ($k = 2; $k*$k <= $n; $k++) {
        // если k - простое (не вычеркнуто)
        if($S[$k] == 1) {
            // то вычеркнем кратные k
            for ($l = $k*$k; $l <= $n; $l += $k) {
                $S[$l] = 0;
            }
        }
    }
    return $S;
}
// присваиваем вывод функции переменной
$arr =(seive(100));
foreach ($arr as $key => $value) {
    if ($value == 1) {
        echo $key.', ';
    }
}
echo '<br>';